Documents/Голосование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Голосование</Name>
			<BasedOn>
				<xr:Item>Document.ИнформационныйЛистДляГолосования</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВопросГолосования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТемыГолосования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнформационныйЛистДляГолосования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчасниковГолосованияПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчасниковГолосованияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимоГолосовЗА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыГолосования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОтветовНаВопросыГолосования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Голосование/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнформационныйЛистДляГолосования") Тогда
		// Заполнение шапки
		ВопросГолосования = ДанныеЗаполнения.ВопросГолосования;
		Здание = ДанныеЗаполнения.Здание;
		Комментарий = ДанныеЗаполнения.Комментарий;
		НеобходимоГолосовЗА = ДанныеЗаполнения.НеобходимоГолосовЗА;
		Организация = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		КоличествоУчасниковГолосованияПлан = ДанныеЗаполнения.УчастникиГолосования.Количество();
		Для Каждого ТекСтрокаУчастникиГолосования Из ДанныеЗаполнения.УчастникиГолосования Цикл
			НоваяСтрока = РезультатыГолосования.Добавить();
			НоваяСтрока.ЛицевойСчет = ТекСтрокаУчастникиГолосования.ЛицевойСчет;
			НоваяСтрока.ОтветственныйВладелец = ТекСтрокаУчастникиГолосования.ОтветственныйВладелец;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
